Тестовая_база_ERP_14/src/Documents/CRM_ЭтапКалендарногоПлана/CRM_ЭтапКалендарногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_ЭтапКалендарногоПлана</name>
  <basedOn>Catalog.CRM_ЭтапыПроектов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.CRM_ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаОкончания</name>
    <comment>Фактическая дата окончания задачи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <comment>Описание результата закрытия точки</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыЭтаповКалендарногоПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Название задачи проекта или контрольной точки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.CRM_ТипыЭтапов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОтменыЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <comment>Признак того что этап введен вручную</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыКонтекстаФайлов</name>
    <attributes>
      <name>ВариантКонтекстаФайлов</name>
      <type>
        <types>CatalogRef.CRM_ВариантыКонтекстаФайла</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Смещения</name>
    <comment>История смещения сроков КТ</comment>
    <attributes>
      <name>СмещениеДатаНачало</name>
      <comment>История смещенной даты</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеДатаОкончание</name>
      <comment>История смещений даты</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>обязателен для заполнения</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <comment>Автор изменения</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <comment>Участники и ответственные по задаче/контрольной точке</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>Признак ответственного</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйДляОтбора</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Enums/CRM_СтатусыЭтаповКалендарногоПлана/CRM_СтатусыЭтаповКалендарногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыЭтаповКалендарногоПлана</name>
  <enumValues>
    <name>Запланирована</name>
    <comment>Используется при создании</comment>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Проверена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/CRM_СтатусыПроектов/CRM_СтатусыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыПроектов</name>
  <comment>Статусы проектов</comment>
  <enumValues>
    <name>Планируется</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/CRM_ТипыЭтапов/CRM_ТипыЭтапов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ТипыЭтапов</name>
  <enumValues>
    <name>Этап</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяТочка</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ДолжностнаяПозиция</name>
    <type>
      <types>CatalogRef.CRM_ДолжностныеПозиции</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ОтписалсяОтEmailРассылок</name>
    <comment>Отписался от Email рассылок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Планируемый</name>
    <comment>Участвует в планировании проектов</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_УчаствуетВАнкетировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Фотография</name>
    <comment>Фотография клиента частное лицо</comment>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЕмейлДляСинхронизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АГ_ФайлФаксимильнаяПечать</name>
    <type>
      <types>CatalogRef.ПользователиПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>сфпВремяЗадержкиНабораДобавочногоНомера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CRM_ДополнительнаяИнформация</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.CRM_ДополнительнаяИнформация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРегистрации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Documents/CRM_ЭтапКалендарногоПлана/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура заполняет список участников мероприятия
//
// Параметры: Нет
//
Процедура ЗаполнитьСписокУчастников() Экспорт
	
	СписокУчастников = "";
	ОтветственныйИсполнитель = Справочники.Пользователи.ПустаяСсылка();
	Для Каждого Участник Из Участники Цикл
		СписокУчастников = СписокУчастников + ?(СписокУчастников = "","","; ") + Участник.Пользователь;
		Если Участник.Ответственный Тогда
			Если НЕ ЗначениеЗаполнено(ОтветственныйИсполнитель) Тогда
				ОтветственныйИсполнитель = Участник.Пользователь;
			КонецЕсли;
		Иначе
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	CRM_ОбщегоНазначенияСервер.ЗаполнитьШапкуДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
	Дата = ТекущаяДатаСеанса();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Проекты") Тогда
		Проект = ДанныеЗаполнения;
		Подразделение = Проект.CRM_Подразделение;
		Этап = Проект.CRM_ТекущийЭтап;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.CRM_ЭтапыПроектов") Тогда
		Проект = ДанныеЗаполнения.Владелец;
		Подразделение = Проект.CRM_Подразделение;
		Этап = ДанныеЗаполнения;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		//Если ДанныеЗаполнения.Свойство("ПлановаяДатаНачала") Тогда
		//	ПлановаяДатаНачала = ДанныеЗаполнения.ПлановаяДатаНачала;
		//КонецЕсли;
		//	
		//Если ДанныеЗаполнения.Свойство("ПлановаяДатаОкончания") Тогда
		//	ПлановаяДатаОкончания = ДанныеЗаполнения.ПлановаяДатаОкончания;
		//КонецЕсли;
		//	
		//Если ДанныеЗаполнения.Свойство("ПлановаяДлительность") Тогда
		//	ПлановаяДлительность = ДанныеЗаполнения.ПлановаяДлительность;
		//КонецЕсли;
			
		Если ДанныеЗаполнения.Свойство("Подразделение") Тогда
			Подразделение = ДанныеЗаполнения.Подразделение;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("Этап") И ЗначениеЗаполнено(ДанныеЗаполнения.Этап) Тогда
			Этап 		  = ДанныеЗаполнения.Этап;
			Проект		  = Этап.Владелец; 
			Подразделение = Проект.CRM_Подразделение;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("Проект") И ЗначениеЗаполнено(ДанныеЗаполнения.Проект) Тогда
			Проект 		  = ДанныеЗаполнения.Проект; 
			Подразделение = ДанныеЗаполнения.Проект.CRM_Подразделение;
		КонецЕсли;
		
		Если ДанныеЗаполнения.Свойство("Исполнитель") Тогда
			СтрокаПользователь = Участники.Добавить();
			СтрокаПользователь.Пользователь = ДанныеЗаполнения.Исполнитель;
			Если  (ДанныеЗаполнения.Свойство("Проект") И ДанныеЗаполнения.Проект.Ответственный = ДанныеЗаполнения.Исполнитель) ИЛИ
				  (ДанныеЗаполнения.Свойство("Этап") И ДанныеЗаполнения.Этап.Ответственный = ДанныеЗаполнения.Исполнитель) Тогда
				СтрокаПользователь.Ответственный = Истина;
			КонецЕсли;
			КИПользователя = CRM_УправлениеПроектамиСервер.ПолучитьКИУчастника(СтрокаПользователь.Пользователь);
			СтрокаПользователь.Адрес = КИПользователя.Адрес;
			СтрокаПользователь.Телефон = КИПользователя.Телефон;
		КонецЕсли;

	ИначеЕсли НЕ ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Подразделение = CRM_ОбщегоНазначенияСервер.ТекущийПользователь().Подразделение;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// Очистим табличные части и реквизиты.
	Смещения.Очистить();
	ЧекЛист.Очистить();
	Для каждого Строка из ОбъектКопирования.ЧекЛист Цикл
		Если НЕ Строка.Выполнение Тогда
			НовСтрока = ЧекЛист.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
		КонецЕсли;
	КонецЦикла;
	
	Дата  = ТекущаяДатаСеанса();
	ПлановаяДатаНачала = ТекущаяДатаСеанса();
	ПлановаяДатаОкончания = Дата(1,1,1);
	ПлановаяДлительность = 0;
	ФактическаяДатаНачала = Дата(1,1,1);
	ФактическаяДатаОкончания = Дата(1,1,1);
	ФактическаяДлительность = 0;
	Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Запланирована;
	
	Результат = "";
	Автор 	  = CRM_ОбщегоНазначенияСервер.ТекущийПользователь();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокУчастников();
	
	Если ФактическаяДатаОкончания <> Дата(1,1,1) И Статус <> Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Отменена
			И Статус <> Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Проверена Тогда
		Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Выполнена;
	КонецЕсли;
	
	Если Проект.CRM_Статус = Перечисления.CRM_СтатусыПроектов.ВРаботе И ЗначениеЗаполнено(ПлановаяДатаНачала) 
		 И ПлановаяДатаНачала <= НачалоДня(ТекущаяДата()) И Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Запланирована Тогда
		
		 Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.ВРаботе;
		
	 КонецЕсли;
	
	Если ЗначениеЗаполнено(ФактическаяДатаНачала) 
		И ФактическаяДатаНачала <= НачалоДня(ТекущаяДата()) И Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Запланирована Тогда
		
		Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.ВРаботе;
	
	ИначеЕсли ТипЭтапа = Перечисления.CRM_ТипыЭтапов.Этап И Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.ВРаботе 
			И Ссылка.Статус <> Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.ВРаботе Тогда
		
		ФактическаяДатаНачала = ТекущаяДатаСеанса();
		 
	КонецЕсли;
	
	// Минимизируем процедуру обновления дат пакетов задач
 	Если ПлановаяДатаНачала <> Ссылка.ПлановаяДатаНачала ИЛИ ПлановаяДатаОкончания <> Ссылка.ПлановаяДатаОкончания ИЛИ
		 ФактическаяДатаНачала <> Ссылка.ФактическаяДатаНачала ИЛИ ФактическаяДатаОкончания <> Ссылка.ФактическаяДатаОкончания  ИЛИ Этап <> Ссылка.Этап
		 ИЛИ (Статус <> Ссылка.Статус И (Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Отменена ИЛИ Ссылка.Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Отменена))
		 ИЛИ ПометкаУдаления <> Ссылка.ПометкаУдаления Тогда
		ДополнительныеСвойства.Вставить("ОбновитьДатыПакетов", Истина);
		Если Этап <> Ссылка.Этап Тогда
			ДополнительныеСвойства.Вставить("ПредыдущийЭтап", Ссылка.Этап);
		КонецЕсли;
	КонецЕсли;
	МассивНовыхУчастников = Новый Массив;
	ТекПользователь = Пользователи.ТекущийПользователь();
	Для каждого Участник из Участники Цикл
		Если Ссылка.Участники.НайтиСтроки(Новый Структура("Пользователь", Участник.Пользователь)).Количество() = 0 Тогда
			Если Участник.Пользователь = ТекПользователь Тогда
				Продолжить;
			КонецЕсли;
			МассивНовыхУчастников.Добавить(Участник.Пользователь);
		КонецЕсли;
	КонецЦикла;
	Если МассивНовыхУчастников.Количество()>0 Тогда
		ДополнительныеСвойства.Вставить("МассивУчастниковДляОповещенияОЗадаче", МассивНовыхУчастников);
	КонецЕсли;
	
	МассивУдаленныхУчастников = Новый Массив;
	Для каждого Участник из Ссылка.Участники Цикл
		Если Участники.НайтиСтроки(Новый Структура("Пользователь", Участник.Пользователь)).Количество() = 0 Тогда
			МассивУдаленныхУчастников.Добавить(Участник.Пользователь);
		КонецЕсли;
	КонецЦикла;
	Если МассивУдаленныхУчастников.Количество()>0 Тогда
		ДополнительныеСвойства.Вставить("МассивУдаленныхУчастников", МассивУдаленныхУчастников);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ОбновитьДатыПакетов") Тогда
		// Обновим все даты пакета задачи и всех родителей этого пакета (если даты были изменены).
		Если ЗначениеЗаполнено(Этап) Тогда
			CRM_УправлениеПроектамиВызовСервера.ОбновитьДатыПакетаЗадачИВсехРодителей(Этап);
		КонецЕсли;
		Если ДополнительныеСвойства.Свойство("ПредыдущийЭтап") И ЗначениеЗаполнено(ДополнительныеСвойства.ПредыдущийЭтап) Тогда
			CRM_УправлениеПроектамиВызовСервера.ОбновитьДатыПакетаЗадачИВсехРодителей(ДополнительныеСвойства.ПредыдущийЭтап);
		КонецЕсли;
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("МассивУчастниковДляОповещенияОЗадаче") Тогда
		ВидОповещения = Справочники.CRM_ВидыОповещений.ОповещатьОНовыхЗадачах;
		ПараметрыОповещения = CRM_ОповещенияСервер.ПолучитьПараметрыОповещения(ДополнительныеСвойства.МассивУчастниковДляОповещенияОЗадаче, ВидОповещения, Ссылка);
		Если НЕ (ПараметрыОповещения = Неопределено) Тогда
			CRM_ОповещенияСервер.ДобавитьОповещение(ПараметрыОповещения);
		КонецЕсли;
	КонецЕсли;
	Если ДополнительныеСвойства.Свойство("МассивУдаленныхУчастников") Тогда
		Для каждого УдаленныйУчастник из ДополнительныеСвойства.МассивУдаленныхУчастников Цикл
			CRM_ОповещенияСервер.УдалитьОповещения(Ссылка, УдаленныйУчастник);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
